# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
# [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

# homework 11_1 - solution

# На прикладі задачі з вхідним рядком: numbers = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]
def sum_of_numbers_in_array(number_string):
    # Початкова сума чисел поточного рядка
    summ_of_numbers = 0
    # Розділяємо рядок по комі та обробляємо кожне значення
    for x in number_string.split(sep=","):
        try:
            # Перетворюємо строкове значення (str) на ціле число (int).
            # Саме тут може виникнути ValueError.
            number = int(x)
            # Додаємо отримане число до загальної суми
            summ_of_numbers += number
        except ValueError:
            # Якщо значення не можна перетворити на число, позначаємо результат як некоректний через ValueError
            summ_of_numbers = None

            # Припиняємо обробку рядка, при виникненні ValueError
            break
    # Повертаємо суму або None, якщо в рядку було некоректне значення (ValueError)
    return summ_of_numbers

# Список рядків, для обробки
numbers = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

# Послідовно обробляємо кожен рядок зі списку
for number_string in numbers:
    # Передаємо поточний рядок у функцію та отримуємо результат
    test = sum_of_numbers_in_array(number_string)
    # None (з результату роботи функції sum_of_numbers_in_array()) означає, що рядок містив некоректне значення
    if test is None:
        print(f'Не можу це зробити!')
    else:
        # Якщо помилки не було - виводимо отриману суму
        print(test)
    # Expected result
    # 10
    # 60
    # Не можу це зробити!
