# Напишіть цикл, який буде вимагати від користувача ввести слово,
# в якому є літера "h" (враховуються як великі так і маленькі).
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".

# Запускаємо нескінчений цикл вводу даних користувача до виконання умови
while True:
    input_word = input("Введіть слово з літерою 'h' або 'H':")
    # умова для виходу з циклу - наявність літери h + приведення до нижнього регістру,
    # щоб не виконувати дві перевірки
    if 'h' in input_word.lower():
        break
# Виводимо результат
print(f'Ви ввели слово з літерами "h" або "H": {input_word}')