# Є ліст з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому лісті
#
#     Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#     Ви можете перевірити це в інкогніто-режимі вашого браузера.
#     Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

# Вирішення ДЗ 6.4 на прикладі списку: [123, 3, 24, 3249, 08, 30, 29, 840, 2, 9, 84, 9, 8]

# Вхідний список чисел
list_example = [123, 3, 24, 3249, 0, 8, 30, 29, 840, 2, 9, 84, 9, 8]

# Початкове значення суми парних чисел
sum_of_even_numbers = 0

# Перебираємо усі числа в списку на відповідність ознаки парності
for number in list_example:
    if number % 2 == 0:

        # Накопичуємо результат пошуку парних чисел додаючи його до попередньо знайденого
        sum_of_even_numbers = sum_of_even_numbers + number # або альтернативно sum_of_pair_numbers += number
# Відображаємо суму усіх парних чисел
print(f'Сума усіх парних чисел у списку: {sum_of_even_numbers}')